Feature: Споделяне на връзка към видео и възпроизвеждане

Scenario: Потребителят иска да сподели видео
  Given Намерил е линка за видеото което иска да споделя
  When въведе Линка в полето
  Then Линка е валиден

Scenario: Потребителя иска да види детайлите на дадено видео
  Given Има вече създадена стая
  When Избере да види детайлите на видеото
  Then Детайлите се показват

Scenario: Харесване на видео
  Given Потребителя е вече в стая
  When Иска да хареса видеото в стаята
  Then Показва се съобщение за успешно харесване


Scenario: Премахване на видео от стаята
  Given Потребителят иска да изтрие видеото
  When Натисне бутона за изтриване
  Then Показва се съобщение за успешно изтриване

  Scenario: Въвеждане на невалиден линк
    Given Потребителя иска да въведе линк в стаята
    When Линкът е невалиден ""
    Then ПОказва се съобщение за грешка
