Feature: Стая

Scenario: Създаване на стая
  Given Потребителят иска да създаде стая
  When Избере създаване на стая
  Then Трябва да види че стаята е създадена

Scenario: Редактиране на името на стая
  Given Потребителят Избира да промени името на стаята
  When Въвежда новото име
  Then Вижда вече променената стая

Scenario: Генериране на Урл адрес на стая
  Given Потребителя иска да сподели връзка към стаята
  When Генерира линка за стаята
  Then Вижга генерираният линк

  Scenario: Редактиране на името на стая
    Given Потребителят Избира да промени името на стаята
    When Въвежда новото име което е ""
    Then Вижда съобщение за грешка


Scenario: Потребителя иска да изтрие стая
  Given Иска да изтрие стая
  When Избира стаята
  Then Стаята бива изтрита

